3280441136-lab/NUIST/sdkconfig.defaults
# Team baseline for Waveshare ESP32-P4-WIFI6.
# sdkconfig is generated locally by ESP-IDF and stays ignored by Git.

CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

# Waveshare ESP32-P4-WIFI6 uses ESP32-P4 rev v1.x hardware.
# ESP-IDF treats P4 rev <3.0 and rev >=3.0 as mutually exclusive.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_ESP_REV_MIN_FULL=100

# Waveshare ESP32-P4-WIFI6: 32MB Nor Flash, 32MB PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
